app/Views/backend/admin/user-package/table.php



        <?php foreach($data_list as $key=> $value) {
            $user = $db->table("users")->where(["id"=>$value->user_id,])->get()->getFirstRow();
---
SELECT *
FROM `users`
WHERE `id` = '18926'