app/Views/web/include/header-nav.php


                                        <div class="row">
                                           <?php
                                            $services = $db->table("service")
                                            ->limit(30)
                                                           ->where(["status" => 1])
                                                           ->get()
                                                           ->getResult();
---
SELECT *
FROM `service`
WHERE `status` = 1
 LIMIT 30