app/Views/web/include/meta.php

SELECT *
FROM `setting`
WHERE `name` = 'logo'
---
<?php
$logo = json_decode($db->table('setting')->getWhere(["name"=>'logo',])->getRow()->data);