app/Helpers/My_helper.php

  function get_user()
  {
    $session = session()->get('user');
    if(!empty($session))
    {
      $user_id = $session['id'];
      $db = db_connect();
      return $user = $db->table('users')->where('users.id', $user_id)
      ->join('countries', 'countries.id = ' . 'users.country', 'left')
      ->join('states', 'states.id = ' . 'users.state', 'left')
      ->select("users.*, countries.name as country_name, states.name as state_name ")
      ->get()->getRow();
---
SELECT `users`.*, `countries`.`name` as `country_name`, `states`.`name` as `state_name`
FROM `users`
LEFT JOIN `countries` ON `countries`.`id` = `users`.`country`
LEFT JOIN `states` ON `states`.`id` = `users`.`state`
WHERE `users`.`id` = '4345'

  function get_role_by_id($role_id)
  {
    $db = db_connect();
    $data = $db->table("role")->orderBy("name","asc")->where(["id"=>$role_id,])->get()->getRow();
---
SELECT *
FROM `role`
WHERE `id` = '2'
ORDER BY `name` ASC

    function wallet($user_id)
    {
        $db = \Config\Database::connect();
        return $db->table('wallet')
                  ->where('user_id', $user_id)
                  ->orderBy('id', 'DESC')
                  ->get()
                  ->getFirstRow();
---
SELECT *
FROM `wallet`
WHERE `user_id` = '4353'
ORDER BY `id` DESC

    function my_plans($user_id)
    {
        $db = \Config\Database::connect();
        return $db->table('user_package')
                  ->where('user_id', $user_id)
                  ->orderBy('id', 'DESC')
                  ->get()
                  ->getResult();
---
SELECT *
FROM `user_package`
WHERE `user_id` = '4353'
ORDER BY `id` DESC