app/Filters/RequestLogger.php

INSERT INTO `request_logs` (`user_id`, `method`, `uri`, `query_string`, `payload`, `headers`, `ip_address`, `user_agent`, `add_date_time`, `update_date_time`) VALUES (NULL, 'GET', 'http://localhost/projects/dimplemam/rishtehirishte/css/bootstrap.min.css.map', '', '[]', '{\"Host\":\"localhost\",\"Connection\":\"keep-alive\",\"Sec-Fetch-Site\":\"same-origin\",\"Sec-Fetch-Mode\":\"no-cors\",\"Sec-Fetch-Dest\":\"empty\",\"User-Agent\":\"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/141.0.0.0 Safari/537.36\",\"Accept-Encoding\":\"gzip, deflate, br, zstd\",\"Accept-Language\":\"en-US,en;q=0.9\",\"Cookie\":\"_ga=GA1.1.2055712487.1750920942; _ga_CPDSD2DCNP=GS2.1.s1751460701$o9$g1$t1751461584$j60$l0$h0; unique_id=id_1754373277399_31928; _ga_BRJBFG5B3K=GS2.1.s1755326248$o3$g1$t1755326923$j56$l0$h0; _ga_ZXT4MKSCHV=GS2.1.s1755334109$o5$g1$t1755335639$j60$l0$h0; debug-bar-position=bottom; debug-bar-theme=light; adminuiuxlayoutmode=light; _ga_TYJ07W37VP=GS2.1.s1757579421$o17$g0$t1757579421$j60$l0$h0; __stripe_mid=54fa9031-a74d-4c23-aa2c-31c3b4eb669134dced; debug-bar-state=minimized; csrf_cookie_name=34d04af266d9575b36e0eaa44ffc2936; ci_session=b900a3bfbb49f68bca6ae32da7ba8781\"}', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/141.0.0.0 Safari/537.36', '2025-11-12 16:44:48', '2025-11-12 16:44:48')
---
        // Insert into DB (use model)
        try {
            $model = new RequestLogModel();
            $model->insert($data);