app/Controllers/Home.php

SELECT *
FROM `religion`
WHERE `religion`.`status` = 1
ORDER BY `religion`.`name` ASC
---
    public function search_religion($value='')
    {
        $search = $this->request->getVar('search');
        $table_name = 'religion';
        $builder = $this->db->table($table_name)->where("{$table_name}.status", 1);
        if (!empty($search)) {
            $builder->groupStart()->like("{$table_name}.name", $search)->groupEnd();
        }
        $data_list = $builder->orderBy("{$table_name}.name", 'desc')->limit(50, 0)->get()->getResult();